Revit 2027 API
BuiltInFailures.WallFailures.CannotChangeSubwall Property
 Changing the type of a subwall is not allowed. Edit the stacked wall type instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeSubwall { get; }
Public Shared ReadOnly Property CannotChangeSubwall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeSubwall {
	FailureDefinitionId^ get ();
}
static member CannotChangeSubwall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace